using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace EgyptCurrencyRates.Help
{
    public class Switch
    {
        public static string Bank(string name)
        {
            name = name.Trim().Replace("-", " ");

            /*
بنك مصر
HSBC بنك
بنك قناة السويس
البنك المركزي المصري
متوسط أسعار السوق بالجنية المصرى
بنك البركة
البنك العربى الافريقى الدولى
بنك فيصل الإسلامي المصري
بنك القاهرة
البنك الأهلي اليوناني
كريدي أجريكول
البنك المصري لتنمية الصادرات
المصرف المتحد
بنك بيريوس
بنك الشركة المصرفية العربية الدولية SAIB
بنك بلوم مصر
بنك قطر الوطني
بنك الكويت الوطني
بنك المشرق
البنك الأهلي المتحد
بنك أبوظبي الوطني
بنك عودة
بنك التنمية الصناعية
المصرف العربي الدولي
البنك العقاري المصري العربي
بنك الاستثمار العربي
بنك الإمارات دبي الوطني
             */
            switch (name)
            {
                case "البنك الاهلى المصرى":
                    return "البنك الأهلي المصري";
                case "hsbc":
                    return "HSBC بنك";
                case "البنك المركزى":
                    return "البنك-المركزي المصري";
                case "البنك الاهلي الكويتي بيريوس":
                    return "البنك الأهلي الكويتي";
                case "بنك بيريوس":
                    return "البنك الأهلي الكويتي";
                case "(CIB) البنك التجارى الدولى":
                    return "(CIB) البنك التجاري الدولي";
                case "بنك الاسكندرية":
                    return "بنك الإسكندرية";
                case "بنك الاسكان والتعمير":
                    return "بنك التعمير والإسكان";
                case "متوسط أسعار السوق بالجنية المصرى":
                    return "متوسط أسعار السوق بالجنيه المصري";
                case "بنك مصر ايران للتنمية":
                    return "بنك مصر إيران للتنمية";
                case "البنك العربى الافريقى الدولى":
                    return "البنك العربي الأفريقي الدولي";
                case "مصرف ابوظبي الاسلامي":
                    return "مصرف أبو ظبي الإسلامي";
                case "البنك المصرى الخليجى":
                    return "البنك المصري الخليجي";
                case "بنك الائتمان الزراعي":
                    return "بنك التنمية والائتمان الزراعي";
                default:
                    return name;
            }
        }


        public static string Currency(string currency)
        {
            currency = currency.Replace("-", " ").Trim();

            switch (currency)
            {
                case "الدولار الأمريكى":
                    return "الدولار";
                case "درهم الإماراتي":
                    return "الدرهم الإماراتي";
                case "الدولار الاسترالي":
                    return "الدولار الأسترالي";
                case "الدولار الكندى":
                    return "الدولار الكندي";
                case "الكرونة الدنماركى":
                    return "الكرونة الدنماركي";
                case "الدينار الإردني":
                    return "الدينار الأردني";
                case "اليوان الصينى":
                    return "اليوان الصيني";
                default:
                    return currency;
            }
        }
    }
}
