using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace EgyptCurrencyRates.ViewModels
{
    public enum DollarTodayCurrency
    {
        الدولار = 1,
        اليورو = 2,
        الإسترليني = 3,
        الدولار_الاسترالي = 5,
        الدولار_الكندى = 7,
        الكرونة_الدنماركى = 8,
        الكرونة_النرويجية = 9,
        الكرونة_السويدية = 10,
        الفرنك = 11,
        الين = 12,
        الريال_السعودي = 13,
        الدينار_الكويتي = 14,
        الدرهم_الإماراتي = 15,
        الدينار_البحريني = 16,
        الريال_العماني = 17,
        الريال_القطري = 18,
        الدينار_الإردني = 19,
        اليوان_الصينى = 20,
        البات_التايلندي = 21,
        ليرة_لبناني = 22,
    }

    public enum EgyptRatesCurrency
    {
        //كرونا_سويدى = "0",
        //ريال_قطري = "0",
        //دينار_بحريني = "دينار بحريني/BHD",
        //ريال_عماني = "0",
        //دينار_إردني = "0",
        //يورو = "0",
        //دولار_إسترالي = "0",
        //كرونا_دنماركي = "0",
        //كرونا_نرويجي = "0",
        //دولار_امريكي = "0",
        //درهم_إماراتي = "0",
        //دينار_كويتي = "0",
        //ريال_سعودي = "0",
        //دولار_كندي = "0",
        //ين_ياباني = "0",
        //فرنك_سويسرى = "0",
        //جنيه_إسترلينى = "0",
    }


    public enum DollarTodayBanks
    {
        البنك_الاهلى_المصرى = 1,
        بنك_مصر = 2,
        البنك_التجارى_الدولى = 3,
        HSBC_بنك = 4,
        بنك_قناة_السويس = 5,
        بنك_الاسكندرية = 6,
        بنك_الاسكان_والتعمير = 7,
        البنك_المركزي_المصري = 8,
        متوسط_أسعار_السوق_بالجنية_المصرى = 9,
        بنك_مصر_ايران_للتنمية = 10,
        بنك_البركة = 11,
        البنك_العربى_الافريقى_الدولى = 12,
        مصرف_ابوظبي_الاسلامي = 13,
        بنك_فيصل_الإسلامي_المصري = 14,
        بنك_القاهرة = 15,
        البنك_الأهلي_اليوناني = 16,
        البنك_المصرى_الخليجى = 17,
        بنك_الائتمان_الزراعي = 18,
        كريدي_أجريكول = 19,
        البنك_المصري_لتنمية_الصادرات = 20,
        المصرف_المتحد = 21,
        بنك_بيريوس = 22,
        بنك_الشركة_المصرفية_العربية_الدولية_SAIB = 23,
        بنك_بلوم_مصر = 24,
        بنك_قطر_الوطني = 25,
        بنك_الكويت_الوطني = 27,
        بنك_المشرق = 28,
        البنك_الأهلي_المتحد = 29,
        بنك_أبوظبي_الوطني = 30,
        بنك_عودة = 31,
        البنك_الاهلي_الكويتي_بيريوس = 32,
        بنك_التنمية_الصناعية = 33,
        المصرف_العربي_الدولي = 34,
        البنك_العقاري_المصري_العربي = 35,
        بنك_الاستثمار_العربي = 36,
        بنك_الإمارات_دبي_الوطني = 37,
    }

    public enum EgyptRatesBanks
    {
        البنك_العربي_الأفريقي_الدولى = 2,
        البنك_المركزى_المصرى = 13,
        اتش_اس_بى_سى_HSBC = 24,
        البنك_التجاري_الدولي = 3,
        المصرف_المتحد = 15,
        بنك_عودة = 25,
        البنك_الأهلي_المصري = 4,
        بنك_بلوم = 16,
        المصرف_العربى_الدولى = 28,
        بنك_مصر = 5,
        بنك_مصر_إيران_التنمية = 17,
        بنك_الكويت_الوطني_NBK = 29,
        بنك_البركة = 7,
        مصرف_أبوظبى_الإسلامى = 18,
        بنك_الإستثمار_العربي_AIB = 30,
        بنك_قناة_السويس = 8,
        بنك_التعمير_والإسكان = 19,
        بنك_التنمية_الصناعية = 32,
        كريدى_أجريكول = 9,
        البنك_المصرى_الخليجى = 22,
        بنك_الإسكندرية = 1,
        البنك_الأهلى_الكويتى = 11,
        البنك_المصرى_لتنمية_الصادرات = 23,
        بنك_المشرق = 27,
        بنك_الشركة_المصرفية_العربية_الدولية_SAIB = 14,
        البنك_العقاري_المصري_العربي = 31,
        البنك_الأهلي_اليوناني = 21,

    }
}
